test/PerformanceTesting.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - flow:
      - post:
          url: "/login"
          json:
            username: "faculty"
            password: "faculty"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
            - json: "$.status"
              as: "loginStatus"

      
      - think: 1
      - expect:
          - statusCode: 200
          - variable: "accessToken"
          - variable: "loginStatus"